Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_cmu.h
/**
  *******************************************************************************************************
  * @file    fm33ld5xx_fl_cmu.h
  * @author  FMSH Application Team
  * @brief   Head file of CMU FL Module
  *******************************************************************************************************
  * @attention
  * Copyright 2025 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  *
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS"AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LD5XX_FL_CMU_H
#define __FM33LD5XX_FL_CMU_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33ld5xx_fl_def.h"
/** @addtogroup FM33LD5XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup CMU_FL_ES_INIT CMU Exported Init structures
  * @{
  */
/**
  * @brief FL CMU Init Sturcture definition
  */
typedef enum
{
    FL_SYSTEM_CLOCK_RCHF_16M = 0,
    FL_SYSTEM_CLOCK_PLL32M_RCHF,
	  FL_SYSTEM_CLOCK_PLL32M_XTHF8M,
    FL_SYSTEM_CLOCK_RCLP,
    FL_SYSTEM_CLOCK_XTHF,
} FL_SystemClock;
/**
  * @brief FL CMU RCHF Init Sturcture definition
  */
typedef struct
{
    /* RCHF频率 */
    uint32_t Frequency;
}FL_CMU_RCHF_InitTypeDef;

/**
  * @brief FL CMU XTHF Init Sturcture definition
  */
typedef struct
{
    /* XTHF频率 */
    uint32_t Frequency;
    /* XTHF启动等待时间 */
    uint32_t StartWaitTime;
    /* XTHF Bypss使能或禁止 */
    uint32_t Bypass;
    /* XTHF振荡强度 */
    uint32_t DriverStrength;
}FL_CMU_XTHF_InitTypeDef;

/**
  * @brief FL CMU PLL Init Sturcture definition
  */
typedef struct
{
    /* PLL倍频比 */
    uint32_t Multiplier;
    /* PLL参考时钟预分频 */
    uint32_t Prescaler;
    /* PLL时钟源输入选择 */
    uint32_t ClockSource;
}FL_CMU_PLL_InitTypeDef;



/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup CMU_FL_Exported_Constants CMU Exported Constants
  * @{
  */

#define    CMU_SYSCLKSEL_SW_LOC_Pos                               (31U)
#define    CMU_SYSCLKSEL_SW_LOC_Msk                               (0x1U << CMU_SYSCLKSEL_SW_LOC_Pos)
#define    CMU_SYSCLKSEL_SW_LOC                                   CMU_SYSCLKSEL_SW_LOC_Msk

#define    CMU_SYSCLKSEL_SW_LOL_Pos                               (30U)
#define    CMU_SYSCLKSEL_SW_LOL_Msk                               (0x1U << CMU_SYSCLKSEL_SW_LOL_Pos)
#define    CMU_SYSCLKSEL_SW_LOL                                   CMU_SYSCLKSEL_SW_LOL_Msk

#define    CMU_SYSCLKSEL_LSCATS_Pos                               (27U)
#define    CMU_SYSCLKSEL_LSCATS_Msk                               (0x1U << CMU_SYSCLKSEL_LSCATS_Pos)
#define    CMU_SYSCLKSEL_LSCATS                                   CMU_SYSCLKSEL_LSCATS_Msk

#define    CMU_SYSCLKSEL_SLP_ENEXTI_Pos                           (25U)
#define    CMU_SYSCLKSEL_SLP_ENEXTI_Msk                           (0x1U << CMU_SYSCLKSEL_SLP_ENEXTI_Pos)
#define    CMU_SYSCLKSEL_SLP_ENEXTI                               CMU_SYSCLKSEL_SLP_ENEXTI_Msk

#define    CMU_SYSCLKSEL_CKSAFE_CFG_Pos                           (24U)
#define    CMU_SYSCLKSEL_CKSAFE_CFG_Msk                           (0x1U << CMU_SYSCLKSEL_CKSAFE_CFG_Pos)
#define    CMU_SYSCLKSEL_CKSAFE_CFG                               CMU_SYSCLKSEL_CKSAFE_CFG_Msk

#define    CMU_SYSCLKSEL_APB2PRES_Pos                             (19U)
#define    CMU_SYSCLKSEL_APB2PRES_Msk                             (0x7U << CMU_SYSCLKSEL_APB2PRES_Pos)
#define    CMU_SYSCLKSEL_APB2PRES                                 CMU_SYSCLKSEL_APB2PRES_Msk

#define    CMU_SYSCLKSEL_APB1PRES_Pos                             (16U)
#define    CMU_SYSCLKSEL_APB1PRES_Msk                             (0x7U << CMU_SYSCLKSEL_APB1PRES_Pos)
#define    CMU_SYSCLKSEL_APB1PRES                                 CMU_SYSCLKSEL_APB1PRES_Msk

#define    CMU_SYSCLKSEL_AHBPRES_Pos                              (8U)
#define    CMU_SYSCLKSEL_AHBPRES_Msk                              (0x7U << CMU_SYSCLKSEL_AHBPRES_Pos)
#define    CMU_SYSCLKSEL_AHBPRES                                  CMU_SYSCLKSEL_AHBPRES_Msk

#define    CMU_SYSCLKSEL_STCLKSEL_Pos                             (6U)
#define    CMU_SYSCLKSEL_STCLKSEL_Msk                             (0x3U << CMU_SYSCLKSEL_STCLKSEL_Pos)
#define    CMU_SYSCLKSEL_STCLKSEL                                 CMU_SYSCLKSEL_STCLKSEL_Msk

#define    CMU_SYSCLKSEL_SYSCLKSEL_Pos                            (0U)
#define    CMU_SYSCLKSEL_SYSCLKSEL_Msk                            (0x7U << CMU_SYSCLKSEL_SYSCLKSEL_Pos)
#define    CMU_SYSCLKSEL_SYSCLKSEL                                CMU_SYSCLKSEL_SYSCLKSEL_Msk

