Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_cmu.h
/**
  * @brief    Get LPTIM16 Clock Source Setting
  * @rmtoll   OPCCR1    LPT16CKS    FL_CMU_GetLPTIM16ClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_LPTIM16_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_LPTIM16_CLK_SOURCE_LSCLK
  *           @arg @ref FL_CMU_LPTIM16_CLK_SOURCE_RCLP
  *           @arg @ref FL_CMU_LPTIM16_CLK_SOURCE_XTLF
  */
__STATIC_INLINE uint32_t FL_CMU_GetLPTIM16ClockSource(void)
{
    return (uint32_t)(READ_BIT(CMU->OPCCR1, CMU_OPCCR1_LPTIM16CKS_Msk));
}

/**
  * @brief    Set CAN1 Clock Source
  * @rmtoll   OPCCR1    UART3CKS    FL_CMU_SetUART3ClockSource
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CMU_UART3_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_UART3_CLK_SOURCE_RCHF
  *           @arg @ref FL_CMU_UART3_CLK_SOURCE_SYSCLK
  *           @arg @ref FL_CMU_UART3_CLK_SOURCE_XTHF
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_SetUART3ClockSource(uint32_t clock)
{
    MODIFY_REG(CMU->OPCCR1, CMU_OPCCR1_UART3CKS_Msk, clock);
}

/**
  * @brief    Get CAN1 Clock Source Setting
  * @rmtoll   OPCCR1    UART3CKS    FL_CMU_GetUART3ClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_UART3_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_UART3_CLK_SOURCE_RCHF
  *           @arg @ref FL_CMU_UART3_CLK_SOURCE_SYSCLK
  *           @arg @ref FL_CMU_UART3_CLK_SOURCE_XTHF
  */
__STATIC_INLINE uint32_t FL_CMU_GetUART3ClockSource(void)
{
    return (uint32_t)(READ_BIT(CMU->OPCCR1, CMU_OPCCR1_UART3CKS_Msk));
}

/**
  * @brief    Set ATIM Clock Source
  * @rmtoll   OPCCR1    UART2CKS    FL_CMU_SetUART2ClockSource
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CMU_UART2_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_UART2_CLK_SOURCE_RCHF
  *           @arg @ref FL_CMU_UART2_CLK_SOURCE_SYSCLK
  *           @arg @ref FL_CMU_UART2_CLK_SOURCE_XTHF
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_SetUART2ClockSource(uint32_t clock)
{
    MODIFY_REG(CMU->OPCCR1, CMU_OPCCR1_UART2CKS_Msk, clock);
}

/**
  * @brief    Get ATIM Clock Source Setting
  * @rmtoll   OPCCR1    UART2CKS    FL_CMU_GetUART2ClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_UART2_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_UART2_CLK_SOURCE_RCHF
  *           @arg @ref FL_CMU_UART2_CLK_SOURCE_SYSCLK
  *           @arg @ref FL_CMU_UART2_CLK_SOURCE_XTHF
  */
__STATIC_INLINE uint32_t FL_CMU_GetUART2ClockSource(void)
{
    return (uint32_t)(READ_BIT(CMU->OPCCR1, CMU_OPCCR1_UART2CKS_Msk));
}

/**
  * @brief    Set CAN0 Clock Source
  * @rmtoll   OPCCR1    UART1CKS    FL_CMU_SetUART1ClockSource
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CMU_UART1_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_UART1_CLK_SOURCE_RCHF
  *           @arg @ref FL_CMU_UART1_CLK_SOURCE_SYSCLK
  *           @arg @ref FL_CMU_UART1_CLK_SOURCE_XTHF
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_SetUART1ClockSource(uint32_t clock)
{
    MODIFY_REG(CMU->OPCCR1, CMU_OPCCR1_UART1CKS_Msk, clock);
}

/**
  * @brief    Get CAN0 Clock Source Setting
  * @rmtoll   OPCCR1    UART1CKS    FL_CMU_GetUART1ClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_UART1_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_UART1_CLK_SOURCE_RCHF
  *           @arg @ref FL_CMU_UART1_CLK_SOURCE_SYSCLK
  *           @arg @ref FL_CMU_UART1_CLK_SOURCE_XTHF
  */
__STATIC_INLINE uint32_t FL_CMU_GetUART1ClockSource(void)
{
    return (uint32_t)(READ_BIT(CMU->OPCCR1, CMU_OPCCR1_UART1CKS_Msk));
}

/**
  * @brief    Set UART1 Clock Source
  * @rmtoll   OPCCR1    UART0CKS    FL_CMU_SetUART0ClockSource
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CMU_UART0_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_UART0_CLK_SOURCE_RCHF
  *           @arg @ref FL_CMU_UART0_CLK_SOURCE_SYSCLK
  *           @arg @ref FL_CMU_UART0_CLK_SOURCE_XTHF
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_SetUART0ClockSource(uint32_t clock)
{
    MODIFY_REG(CMU->OPCCR1, CMU_OPCCR1_UART0CKS_Msk, clock);
}

/**
  * @brief    Get UART1 Clock Source Setting
  * @rmtoll   OPCCR1    UART0CKS    FL_CMU_GetUART0ClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_UART0_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_UART0_CLK_SOURCE_RCHF
  *           @arg @ref FL_CMU_UART0_CLK_SOURCE_SYSCLK
  *           @arg @ref FL_CMU_UART0_CLK_SOURCE_XTHF
  */
__STATIC_INLINE uint32_t FL_CMU_GetUART0ClockSource(void)
{
    return (uint32_t)(READ_BIT(CMU->OPCCR1, CMU_OPCCR1_UART0CKS_Msk));
}

/**
  * @brief    Set AHB Master Priority
  * @rmtoll   AMCR    MPRIL    FL_CMU_SetAHBMasterPriority
  * @param    priority This parameter can be one of the following values:
  *           @arg @ref FL_CMU_AHB_MASTER_PRIORITY_DMA
  *           @arg @ref FL_CMU_AHB_MASTER_PRIORITY_CPU
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_SetAHBMasterPriority(uint32_t priority)
{
    MODIFY_REG(CMU->AMCR, CMU_AMCR_MPRIL_Msk, priority);
}

/**
  * @brief    Get AHB Master Priority
  * @rmtoll   AMCR    MPRIL    FL_CMU_GetAHBMasterPriority
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_AHB_MASTER_PRIORITY_DMA
  *           @arg @ref FL_CMU_AHB_MASTER_PRIORITY_CPU
  */
__STATIC_INLINE uint32_t FL_CMU_GetAHBMasterPriority(void)
{
    return (uint32_t)(READ_BIT(CMU->AMCR, CMU_AMCR_MPRIL_Msk));
}

/**
  * @brief    Set CANFD0 Clock Source
  * @rmtoll   CFDCR    CANFD0CKS    FL_CMU_SetCANFD0ClockSource
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CMU_CANFD0_CLK_SOURCE_APBCLK
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_SetCANFD0ClockSource(uint32_t clock)
{
    MODIFY_REG(CMU->CFDCR, CMU_CFDCR_CKS_Msk, clock);
}

/**
  * @brief    Set CANFD0 Clock Source RAM 
  * @rmtoll   CFDCR    CANFD0CKRS    FL_CMU_SetCANFD0ClockSourceRam
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CMU_CANFD0_CLK_SOURCE_RAM_AHBCLK
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_SetCANFD0ClockSourceRam(uint32_t clock)
{
    MODIFY_REG(CMU->CFDCR, CMU_CFDCR_CKRS_Msk, clock);
}

/**
  * @brief    Set CANFD0 Clock Source RAM 
  * @rmtoll   CFDCR    CANFD0CKRS    FL_CMU_GetCANFD0ClockSourceRam
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_CANFD0_CLK_SOURCE_RAM_AHBCLK
  */
__STATIC_INLINE uint32_t FL_CMU_GetCANFD0ClockSourceRam(void)
{
    return (uint32_t)(READ_BIT(CMU->CFDCR, CMU_CFDCR_CKRS_Msk));
}
/**
  * @brief    Get CANFD0 Clock Source Setting
  * @rmtoll   CFDCR    CANFD0CKS    FL_CMU_GetCANFD0ClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_CANFD0_CLK_SOURCE_APBCLK
  */
__STATIC_INLINE uint32_t FL_CMU_GetCANFD0ClockSource(void)
{
    return (uint32_t)(READ_BIT(CMU->CFDCR, CMU_CFDCR_CKS_Msk));
}
/**
  * @brief    Enable CANFD Operation Clock
  * @rmtoll   CFDER        FL_CMU_EnableCANFDOperationClock
  * @param    peripheral This parameter can be one of the following values:
  *           @arg @ref FL_CMU_OPCLK_CANFD_COMM
  *           @arg @ref FL_CMU_OPCLK_CANFD_RAM
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_EnableCANFDOperationClock(uint32_t peripheral)
{
    SET_BIT(CMU->CFDER, ((peripheral & 0xffffffff) << 0x0U));
}

/**
  * @brief    Disable CANFD Operation Clock
  * @rmtoll   CFDER        FL_CMU_DisableCANFDOperationClock
  * @param    peripheral This parameter can be one of the following values:
  *           @arg @ref FL_CMU_OPCLK_CANFD_COMM
  *           @arg @ref FL_CMU_OPCLK_CANFD_RAM
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_DisableCANFDOperationClock(uint32_t peripheral)
{
    CLEAR_BIT(CMU->CFDER, ((peripheral & 0xffffffff) << 0x0U));
}

/**
  * @brief    Get CANFD Operation Clock Enable Status
  * @rmtoll   CFDER        FL_CMU_IsEnabledCANFDOperationClock
  * @param    peripheral This parameter can be one of the following values:
  *           @arg @ref FL_CMU_OPCLK_CANFD_COMM
  *           @arg @ref FL_CMU_OPCLK_CANFD_RAM
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CMU_IsEnabledCANFDOperationClock(uint32_t peripheral)
{
    return (uint32_t)(READ_BIT(CMU->CFDER, ((peripheral & 0xffffffff) << 0x0U)) == ((peripheral & 0xffffffff) << 0x0U));
}

/**
  * @brief    Enable CANFD RAM Operation Clock
  * @rmtoll   CFDER    CKRE    FL_CMU_EnableCANFDRAMOperationClock
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_EnableCANFDRAMOperationClock(void)
{
    SET_BIT(CMU->CFDER, CMU_CFDER_CKRE_Msk);
}

/**
  * @brief    Disable CANFD RAM Operation Clock
  * @rmtoll   CFDER    CKRE    FL_CMU_DisableCANFDRAMOperationClock
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_DisableCANFDRAMOperationClock(void)
{
    CLEAR_BIT(CMU->CFDER, CMU_CFDER_CKRE_Msk);
}

/**
  * @brief    Get CANFD RAM Operation Clock Enable Status
  * @rmtoll   CFDER    CKRE    FL_CMU_IsEnabledCANFDRAMOperationClock
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CMU_IsEnabledCANFDRAMOperationClock(void)
{
    return (uint32_t)(READ_BIT(CMU->CFDER, CMU_CFDER_CKRE_Msk) == CMU_CFDER_CKRE_Msk);
}

/**
  * @}
  */

/** @defgroup CMU_FL_EF_Init Initialization and de-initialization functions
  * @{
  */

FL_ErrorStatus FL_CMU_SetSystemClock(FL_SystemClock systemClock);

uint32_t FL_CMU_GetPLLClockFreq(void);
uint32_t FL_CMU_GetRCHFClockFreq(void);
uint32_t FL_CMU_GetRCLFClockFreq(void);
uint32_t FL_CMU_GetSystemClockFreq(void);
uint32_t FL_CMU_GetAPB1ClockFreq(void);
uint32_t FL_CMU_GetAPB2ClockFreq(void);
uint32_t FL_CMU_GetAHBClockFreq(void);

/**
  * @}
  */


/**
  * @}
  */
#ifdef __cplusplus
}
#endif

#endif /* __FM33LD5XX_FL_CMU_H*/

/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
